Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/freedom_of_movement_within_the_eu/freedom_of_movement_in_the_eu.html.txt.tmx
Source language: en
Languages: ga

source: • Rights of citizens of the new member states
ga: • Cearta shaoránaigh na mballstát nua

source: The right to free movement is one of the basic rights of EU citizens
ga: Is ceann de bhunchearta shaoránaigh an AE é an ceart chun saorghluaiseachta

source: This right is provided for in the Treaties governing the EU and in EU Directives and Regulations
ga: Foráiltear an ceart seo sna Conarthaí a rialaíonn an AE agus i dTreoracha agus i Rialacháin AE

source: This document describes the general rules on free movement
ga: Déanann an cháipéis seo cur síos ar rialacha ginearálta na saorghluaiseachta

source: Broadly speaking, the provisions of the Treaties in relation to freedom of movement apply in the same way to the 10 member states that joined the EU in 2004, the 2 member states (Bulgaria and Romania) that joined in January 2007 and Croatia, which joined in July 2013, although some of the rules were not put into effect immediately under the transitional arrangements described below
ga: Go ginearálta, baineann forálacha na gConarthaí i leith saorghluaiseachta leis na 10 mballstát a tháinig isteach san AE i 2004, leis an dá bhallstát nua (An Bhulgáir agus an Rómáin) a tháinig isteach in Eanáir 2007 agus leis an Chróít a tháinig isteach in Iúil 2013, cé nach bhfuil cuid de na rialacha á gcur i bhfeidhm láithreach de réir na socruithe idirthréimhseacha a ndéantar cur síos orthu thíos

source: The EU Treaties have a number of provisions dealing with free movement of people and specifically with free movement of workers
ga: Tá roinnt forálacha i gConarthaí an AE a dhéileálann le saorghluaiseacht daoine agus go sonrach le saorghluaiseacht oibrithe

source: The Treaties provide that "every citizen of the Union shall have the right to move and reside freely within the territory of the Member States subject to the limitations and conditions laid down in the EC Treaty and by the measures adopted to give it effect"
ga: Forálann na Conarthaí "go mbeidh an ceart ag gach uile saoránach de chuid an Aontais saoirse gluaiseachta agus cónaithe a bheith acu taobh istigh de chríocha na mBallstát, faoi réir na dteorainneacha agus na gcoinníollacha atá leagtha síos sa Chonradh CE, agus na mbeart a glacadh chun é a chur i bhfeidhm"

source: The Treaties contain a general prohibition (ban) on discrimination on the grounds of nationality and they specifically state that freedom of movement for workers entails "the abolition of any discrimination based on nationality between workers of the Member States as regards employment, remuneration and other conditions of work and employment". The Treaty provisions on free movement of workers provide that, subject to limitations justified on grounds of public policy, public security or public health, workers have the right to accept offers of employment and to move freely within the territory of the member states in order to take up such offers
ga: Cuireann na Conarthaí toirmeasc (cosc) ginearálta ar idirdhealú ar bhonn náisiúntachta agus luann siad go sonrach go gcuimsíonn saorghluaiseacht oibrithe "deireadh le haon idirdhealú ar bhonn náisiúntachta idir oibrithe na mBallstát, i leith fostaíochta, luach saothair agus coinníollacha oibre agus fostaíochta eile." Sonraíonn na forálacha Conartha i leith shaorghluaiseacht oibrithe go bhfuil sé de cheart ag oibrithe glacadh le tairiscintí oibre agus gluaiseacht go saor taobh istigh de chríocha na mballstát chun glacadh lena leithéid de thairiscintí, faoi réir teorainneacha a bhfuil call leo ar fhorais beartais phoiblí, slándáil phoiblí nó sláinte phoiblí

source: The main EU Directives and Regulations giving effect to the right to free movement of workers are:
ga: Is iad seo na Príomh-Rialacháin agus na Príomh-Threoracha AE a chuireann ceart saorghluaiseachta oibrithe i bhfeidhm:

source: • Regulation No 492/2011 on freedom of movement for workers within the Union
ga: • Rialachán Uimh. 492/2011 ar shaorghluaiseacht oibrithe san Aontas

source: • Directive 2004/38/EC (pdf) on the right of EU citizens and their family members to move and reside freely within the territory of the member states
ga: • Treoir 2004/38/CE (pdf) ar cheart shaoránaigh AE agus ceart bhaill a dteaghlaigh chun saoirse gluaiseachta agus cónaithe laistigh de chríocha na mballstát

source: (Directive 2004/38/EC is implemented in Ireland by the European Communities (Free Movement of Persons) Regulations 2015.)
ga: (Tá Treoir 2004/38/CE curtha i bhfeidhm in Éirinn ag na Comhphobail Eorpacha (Saorghluaiseacht Daoine) Rialacháin 2015)

source: There have been several cases taken to the European Court of Justice which have clarified the rights of workers who move to other member states
ga: Cuireadh roinnt cásanna ar aghaidh chuig Cúirt Bhreithiúnais na hEorpa a shoiléirigh cearta na n-oibrithe a bhogann go dtí ballstáit eile

source: Rights of citizens of the new member states
ga: Cearta shaoránaigh na mballstát nua

source: When new member states join the EU, the terms and conditions which apply to them are set out in accession treaties
ga: Nuair a thagann ballstát nua isteach san AE, sonraítear na téarmaí agus na coinníollacha a bhaineann leo i gconarthaí aontachais

source: These treaties are then part of the overall treaties governing the EU
ga: Is cuid de na conarthaí iomlána a rialaíonn an AE na conarthaí seo ansin

source: Special transitional provisions on free movement of workers were included in the Accession Treaties which apply to the ten member states which joined in May 2004 and in the Accession Treaties with Bulgaria, Romania and Croatia
ga: Cuireadh forálacha idirthréimhseacha speisialta maidir le saorghluaiseacht oibrithe san áireamh sna Conarthaí Aontachais a bhaineann leis na 10 mballstát a tháinig isteach i mBealtaine 2004 agus sna Conarthaí Aontachais leis an mBulgáir, an Rómáin agus an Chróit

source: These transitional provisions meant that the 15 states which were EU members before May 2004 (the original member states) had certain rights to limit free movement for a period
ga: Tugann na forálacha idirthréimhseacha seo ceart faoi leith do na 15 stát a raibh ballraíocht AE acu roimh Bhealtaine 2004 (na ballstáit bhunaidh) chun teorainn a chur le saorghluaiseacht ar feadh tréimhse

source: Citizens of Cyprus and Malta had complete freedom of movement from the start of their membership (but Malta may impose restrictions on other member states)
ga: Bhí saorghluaiseacht iomlán ag saoránaigh na Cipire agus Mhálta ó thús a mballraíochta (ach féadfaidh Malta srianta a chur ar bhallstáit eile)

source: The 10 member states that joined in May 2004
ga: Na 10 mballstát a tháinig isteach i mBealtaine 2004

source: The following transitional arrangements applied to the other 8 new member states that joined the EU in 2004:
ga: Bain na socruithe idirthréimhseacha seo a leanas leis na 8 mballstát nua eile a tháinig isteach san AE in 2004:

source: The transitional arrangements applied to employment
ga: Bain na socruithe idirthréimhseacha le fostaíocht

source: They did not apply to self-employment
ga: Ní bhain siad le féinfhostaíocht

source: This means that in general, citizens of the new member states had the right to set up as self-employed people in the existing member states from 1 May 2004
ga: Is éard is brí leis seo, go ginearálta, ná go raibh an ceart ag saoránaigh na mballstát nua socruithe féinfhostaíochta a dhéanamh sna ballstáit a bhí ann cheana ón 1 Bealtaine 2004

source: (There were some specific exceptions to this; none of these applies in Ireland)
ga: (Bain roinnt eisceachtaí áirithe leis seo; ní raibh feidhm ag aon cheann acu in Éirinn)

source: Further information on working in another EU country is available here
ga: Tá tuilleadh faisnéise faoi obair i dtír AE eile le fáil anseo

source: The right to free movement is subject to some general restrictions and these apply to the citizens of the new member states in the same way as they apply to the citizens of the existing states
ga: Tá an ceart chun saorghluaiseachta faoi réir roinnt srianta ginearálta, agus baineann siad seo le saoránaigh na mballstát nua ar an gcaoi chéanna agus a bhaineann siad leis na ballstáit a bhí ann cheana

source: Citizens of the new member states are entitled to live in any of the existing member states in order to study or as retired people
ga: Tá saoránaigh na mballstát nua i dteideal cónaí in aon cheann de na ballstáit a bhí ann cheana chun staidéar a dhéanamh nó mar dhaoine ar scor

source: This right has always been subject to a number of restrictions and these apply in the same way to citizens of the new member states
ga: Bhí an ceart seo faoi réir roinnt srianta i gcónaí, agus baineann siad seo le saoránaigh na mballstát nua chomh maith céanna

source: Since 2011, there is complete freedom of movement for the 10 member states that joined in 2004
ga: Tá saorghluaiseacht iomlán ann ó 2011 i leith do na 10 mballstát a tháinig isteach i mBealtaine 2004

source: Further information on residence rights of EU/EEA nationals in other EU member states is available here
ga: Tá tuilleadh faisnéise faoi chearta cónaithe na náisiúnach LEE i mballstáit AE eile le fáil anseo

source: Bulgaria and Romania joined the EU on 1 January 2007
ga: Tháinig an Bhulgáir agus an Rómáin isteach san AE ar an 1 Eanáir 2007

source: The transitional arrangements in relation to free movement of workers which applied to them are as follows:
ga: Ba iad seo a leanas na socruithe idirthréimhseacha maidir le saorghluaiseacht oibrithe a bhaineann leo:

source: The existing member states (including the 10 that joined in 2004) could decide to apply restrictions on free movement
ga: D'fhéadfadh na ballstáit a bhí ann cheana (na 10 mballstát a tháinig isteach in 2004 san áireamh) socrú go gcuirfear srianta ar shaorghluaiseacht

source: They did not have to notify the Commission of their intention to do so
ga: Níl aon chall dóibh an Coimisiún a chur ar an eolas más mian leo é sin a dhéanamh

source: Ireland decided to impose such restrictions
ga: Chinn Éire a leithéid de shrianta a chur i bhfeidhm

source: The Irish Government decided to end restrictions on Bulgarians and Romanians accessing the Irish labour market with effect from 1 January 2012
ga: Is éard is brí leis sin ná go raibh saoránaigh na Bulgáire agus na Rómáine faoi réir na riachtanas maidir le cead oibre a raibh feidhm acu sula ndeachaigh siad isteach san AE

source: Since 2014, there is complete freedom of movement from 2014 for Bulgaria and Romania
ga: Tá saorghluaiseacht iomlán ann ó 2014 i leith don Bhulgáir agus don Rómáin

source: Croatia joined the EU on 1 July 2013
ga: Tháinig an Chróit isteach san AE ar an 1 Iúil 2013

source: The transitional arrangements in relation to free movement of workers that apply to Croatia are as follows:
ga: Is iad seo a leanas na socruithe idirthréimhseacha maidir le saorghluaiseacht oibrithe a bhaineann leis an Chróit:

source: From 1 July 2013 to 1 July 2015
ga: Ón 1 Iúil 2013 go dtí an 1 Iúil 2015

source: EU member states could choose to restrict the right of Croatian nationals to work in their country or in particular sectors
ga: Ba fhéidir leis na ballstáit AE roghnaigh chun srianta ar cheart náisiúnaigh an Chróit obair sa tír nó in earnálacha áirithe

source: Ireland decided to allow full free movement
ga: Bheartaigh Éire saorghluaiseacht iomlán a cheadú

source: From 1 July 2015
ga: Ón 1 Iúil 2015

source: The EU member states will be still allowed to maintain some restrictions on the free movement of workers
ga: Beidh na ballstáit AE ceadaithe srianta ar shaorghluaiseacht oibrithe a choimeád

source: This transitional arrangement should in principle come to an end after 5 years but there is a provision whereby an original member state can ask the Commission to continue restrictions for a further 2 years if it was experiencing serious disturbances in its labour market
ga: I bprionsabal ba chóir go gcríochnóidh an socrú idirthréimhseach i ndiaidh 5 bhliain ach tá foráil ann, áfach, a shonraíonn gur féidir le ballstáit bhunaidh iarraidh ar an gCoimisiún leanúint leis na srianta ar feadh 2 bhliain sa bhreis, i gcás go bhfuil suaitheadh mór sa mhargadh saothair acu

source: From 1 July 2020
ga: Ón 1 Iúil 2020

source: There will be complete freedom of movement from 2020 for Croatia, which joined in 2013
ga: Tá saorghluaiseacht iomlán ann ó 2020 i leith don Chróit a tháinig isteach in Iúil 2013
